Revit 2027 API
RebarShapeDefinitionBySegments.AddBendDefaultRadius Method
 Specify a default-radius bend.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddBendDefaultRadius(
	int vertexIndex,
	RebarShapeVertexTurn turn,
	RebarShapeBendAngle angle
)
Public Sub AddBendDefaultRadius (
	vertexIndex As Integer,
	turn As RebarShapeVertexTurn,
	angle As RebarShapeBendAngle
)
public:
void AddBendDefaultRadius(
	int vertexIndex,
	RebarShapeVertexTurn turn,
	RebarShapeBendAngle angle
)
member AddBendDefaultRadius :
        vertexIndex : int *
        turn : RebarShapeVertexTurn *
        angle : RebarShapeBendAngle -> unit
Parameters
vertexIndex Int32
 Index of the vertex (1 to NumberOfVertices - 2).
turn RebarShapeVertexTurn
 Specify turn direction (RebarShapeVertexTurn::Left or RebarShapeVertexTurn::Right).
angle RebarShapeBendAngle
 Specify whether the bend is acute, obtuse, etc.
Exceptions
Exception | Condition
ArgumentException |  vertexIndex is not between 0 and NumberOfVertices.
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 You must add a bend at each vertex except the first and last.
See Also
Reference
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace